import {
  NodeJs,
  ReactJs,
  ReactNative,
  EcmaScript,
  VSCode,
  Strapi,
} from "../assets/courses";
import {
  Coffee,
  SchoolRounded,
  DataObjectRounded,
  DomainVerificationRounded,
} from "@mui/icons-material";
import userAvatar from "../assets/user.png";
export const devWorkInfo = [
  {
    tooltipTitle: "تعداد قهوه های خورده شده",
    icon: <Coffee />,
    total: 1650,
    color: "lightcoral",
  },
  {
    tooltipTitle: "تعداد دوره های من",
    icon: <SchoolRounded />,
    total: 25,
    color: "lightskyblue",
  },
  {
    tooltipTitle: "تعداد پروژه های من ",
    icon: <DataObjectRounded />,
    total: 34,
    color: "lightslategray",
  },
  {
    tooltipTitle: "تعداد پروژه های به پایان رسیده",
    icon: <DomainVerificationRounded />,
    total: 12,
    color: "lightseagreen",
  },
];

export const devEdu = [
  {
    year: "1398-1400",
    cert: "دیپلم",
    major: "رشته علوم تجربی",
    place: "دبیرستان شهید حاج رضا تهرانی",
  },
  {
    year: "1398-1400",
    cert: "دیپلم",
    major: "رشته علوم تجربی",
    place: "دبیرستان شهید حاج رضا تهرانی",
  },
  {
    year: "1398-1400",
    cert: "دیپلم",
    major: "رشته علوم تجربی",
    place: "دبیرستان شهید حاج رضا تهرانی",
  },
  {
    year: "1398-1400",
    cert: "دیپلم",
    major: "رشته علوم تجربی",
    place: "دبیرستان شهید حاج رضا تهرانی",
  },
];

export const courses = [
  {
    title: "دوره جامع نود جی اس",
    image: NodeJs,
    link: "https://toplearn.com/courses/windows/دوره-آموزش-جامع-NodeJs",
    info: ` 2 سال پیش که من شروع به تدریس نود جی اس کردم نود خیلی پرطرفدار بود و هنوزم هست که تا الان خیلی قابلیتهای جدید هم اضافه شده به Node که باعث شده بیشتر و بیشتر طرفدار زیادتری پیدا کنه و تبدیل به ابزاری شده که در همه جای دنیا توسط بهترین توسعه دهندگان استفاده میشه.`,
  },
  {
    title: "دوره صفر تا صد ری اکت",
    image: ReactJs,
    link: "https://toplearn.com/courses/web-design/آموزش-صفر-تا-صد-ReactJs",
    info: `امروزه ری اکت جی اس به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برای ساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک , توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن های خود هستند.`,
  },
  {
    title: "دوره جامع ری اکت نیتیو",
    image: ReactNative,
    link: "https://toplearn.com/courses/web-design/آموزش-جامع-ReactNative",
    info: "یکی از آرزوهای من و شاید خیلی از برنامه نویس ها  این بوده که با یادگیری یک زبان برنامه نویسی برنامه هایی بنویسیم که روی پلتفرم های مختلف اجرا بشه.",
  },
  {
    title: "دوره جامع اکمااسکریپت",
    image: EcmaScript,
    link: "https://toplearn.com/courses/web-design/دوره-آموزش-ECMA-Script",
    info: `اگر با جاوااسکریپت کار کرده باشید حتما در مورد اکمااسکریپت شنیدید،یا  اگر در موردش چیزی به گوشتون نخورده و هنوز جایی از ذهنتون رو مشغول کرده که تفاوت بین ECMAScript و جاوا اسکریپت چی هست باید بگم که
فقط یک بروزرسانی هست که در سال 2015 اتفاق افتاد با توجه به تاریخ خود جاوااسکریپت که در سال 1995 ساخته و ارائه شد `,
  },
  {
    title: "نکات حرفه ایی وی اس کد",
    image: VSCode,
    link: "https://toplearn.com/courses/operating-system/آموزش-نکات-حرفه-ایی-VsCode",
    info: `ویژوال استودیو کد امروزه جایگاه ویژه ایی بین ویرایشگرهای کد داره که روز به روز در حال گسترش هست و میشه گرفت توسعه دهنده و برنامه نویسی نیست که تا الان ازش استفاده ایی نکرده باشه. ویرایشگر کد شما محیط کاره شماست پس باید تمام ابزارهایی که میتونه کار شمارو برای انجام عملی آسونتر کنه رو یاد بگیرید. در این دوره هدف ما آموزش نکات کلیدی، ترفندهای حرفه ایی و افزونه هایی هست که هر توسعه دهنده و برنامه نویس باید باهاشون آشنا باشه.`,
  },
  {
    title: "دوره جامع استرپی",
    image: Strapi,
    link: "https://toplearn.com/courses/web-design/-آموزش-جامع-سیستم-مدیریت-محتوای-Strapi",
    info: `استرپی یک سیستم مدیریت محتوای هدلس و اوپن سورس است که کاملاً با جاوا اسکریپت توسعه یافته و به صورت کامل قابل سفارشی سازی است .

با استفاده از سیستم مدیریت محتوای Strapi به سادگی می توانیم بهترین Api ها را طراحی کنیم و مهمتر از همه محتواها را به سادگی مدیریت کنیم.`,
  },
];

export const userComments = [
  {
    fullname: "یونس قربانی",
    jobTitle: "مدرس و برنامه نویس فول استک",
    avatar: userAvatar,
    comment: `
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
            `,
  },
  {
    fullname: "یونس قربانی",
    jobTitle: "مدرس و برنامه نویس فول استک",
    avatar: userAvatar,
    comment: `
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
            `,
  },
  {
    fullname: "یونس قربانی",
    jobTitle: "مدرس و برنامه نویس فول استک",
    avatar: userAvatar,
    comment: `
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
            `,
  },
  {
    fullname: "یونس قربانی",
    jobTitle: "مدرس و برنامه نویس فول استک",
    avatar: userAvatar,
    comment: `
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
            `,
  },
  {
    fullname: "یونس قربانی",
    jobTitle: "مدرس و برنامه نویس فول استک",
    avatar: userAvatar,
    comment: `
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
            `,
  },
  {
    fullname: "یونس قربانی",
    jobTitle: "مدرس و برنامه نویس فول استک",
    avatar: userAvatar,
    comment: `
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه
            `,
  },
];
